simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
    if (event.event == PSOC_EVT_CAL_START) {
        calStage = 0;
        calDac = 0;
        calMeas = 0;
        calMeasHigh = false;
        calMeasRaw = 0;
        calMeasRawSigned = 0;
        calMeasRawByte = 0;
        calTargetRaw = 0;
        calTargetSigned = 0;
        calTargetRawByte = 0;
        calTargetValid = false;
        adcSnapshotRaw = 0;
        adcSnapshotRawByte = 0;
        calPiRaw = 0;
        calPiRawByte = 0;
        calPiRawEvent = 0;
        calPointIndex = 0;
        g_cal_progress_ack_ms = millis();
        sendCfgAck(PSOC_CMD_CALIBRATE, 2);
        SLAVE_LOG_PRINTF("[CAL] start\n");
        LOGM("CAL_START", "pstate=%u", event.psoc_state);
    } else if (event.event == PSOC_EVT_CAL_DONE) {
        if (!(g_cfg_waiting && g_cfg_sub_cmd == PSOC_CMD_CALIBRATE)) {
            sendCfgAck(PSOC_CMD_CALIBRATE, event.value ? 1 : 0);
        }
        SLAVE_LOG_PRINTF("[CAL] done ok=%u\n", event.value);
        LOGM("CAL_DONE", "ok=%u,pstate=%u", event.value, event.psoc_state);
    } else if (event.event == PSOC_EVT_CAL_BUSY) {
        SLAVE_LOG_PRINTF("[CAL] busy\n");
        LOGM("CAL_BUSY", "pstate=%u", event.psoc_state);
    } else if (event.event == PSOC_EVT_CAL_STAGE_BEGIN) {
        calStage = event.value;
        calDac = 0;
        calMeas = 0;
        calMeasHigh = false;
        calMeasRaw = 0;
        calMeasRawSigned = 0;
        calMeasRawByte = 0;
        calTargetRaw = 0;
        calTargetSigned = 0;
        calTargetRawByte = 0;
        calTargetValid = false;
        adcSnapshotRaw = 0;
        adcSnapshotRawByte = 0;
        calPiRaw = 0;
        calPiRawByte = 0;
        calPiRawEvent = 0;
        calPointIndex = 0;
        g_cal_progress_ack_ms = millis();
        sendCfgAck(PSOC_CMD_CALIBRATE, (uint8_t)(3u + (event.value & 0x03u)));
        SLAVE_LOG_PRINTF("[CAL] begin stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_BEGIN", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_SERVO_STAGE) {
        calStage = event.value;
        calDac = 0;
        calMeas = 0;
        calMeasHigh = false;
        calMeasRaw = 0;
        calMeasRawSigned = 0;
        calMeasRawByte = 0;
        calPointIndex = 0;
        SLAVE_LOG_PRINTF("[CAL] servo stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("SERVO_STAGE", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_CAL_VERIFY_BEGIN) {
        calStage = event.value;
        calDac = 0;
        calMeas = 0;
        calMeasHigh = false;
        calMeasRaw = 0;
        calMeasRawSigned = 0;
        calMeasRawByte = 0;
        calPointIndex = 0;
        g_cal_progress_ack_ms = millis();
        sendCfgAck(PSOC_CMD_CALIBRATE, (uint8_t)(7u + (event.value & 0x03u)));
        SLAVE_LOG_PRINTF("[CAL] verify begin stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_VERIFY_BEGIN", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_CAL_REALCHECK_BEGIN) {
        calStage = event.value;
        calDac = 0;
        calMeas = 0;
        calMeasHigh = false;
        calMeasRaw = 0;
        calMeasRawSigned = 0;
        calMeasRawByte = 0;
        calPointIndex = 0;
        g_cal_progress_ack_ms = millis();
        sendCfgAck(PSOC_CMD_CALIBRATE, (uint8_t)(11u + (event.value & 0x03u)));
        SLAVE_LOG_PRINTF("[CAL] realcheck begin stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_REALCHECK_BEGIN", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_CAL_STAGE_DAC) {
        calDac = event.value;
    } else if (event.event == PSOC_EVT_CAL_SWEEP_DAC) {
        calDac = event.value;
        calSweepRaw = 0;
        calSweepRawByte = 0;
    } else if (event.event == PSOC_EVT_ADC_SNAPSHOT_BEGIN) {
        calStage = event.value;
        calDac = 0;
        calMeasRaw = 0;
        calMeasRawByte = 0;
        calTargetRaw = 0;
        calTargetRawByte = 0;
        calTargetValid = false;
        calSweepRaw = 0;
        calSweepRawByte = 0;
        adcSnapshotRaw = 0;
        adcSnapshotRawByte = 0;
        calPointIndex = 0;
        SLAVE_LOG_PRINTF("[ADC] snapshot begin stage=%u/%s\n",
                         calStage, psocCalStageName(calStage));
        LOGM("ADC_SNAPSHOT_BEGIN", "stage=%u,name=%s",
             calStage, psocCalStageName(calStage));
    } else if (event.event == PSOC_EVT_CAL_STAGE_TARGET32) {
        calTargetRaw = (calTargetRaw << 8) | event.value;
        calTargetRawByte++;
        if (calTargetRawByte >= 4) {
            calTargetRawByte = 0;
            calTargetSigned = (int32_t)calTargetRaw;
            calTargetRaw = 0;
            calTargetValid = true;
            SLAVE_LOG_PRINTF("[CAL] target stage=%u/%s counts=%ld mV=%ld\n",
                             calStage, psocCalStageName(calStage),
                             (long)calTargetSigned,
                             (long)adcCountsToMv(calTargetSigned));
            LOGM("CAL_TARGET", "stage=%u,name=%s,target=%ld,target_mV=%ld",
                 calStage, psocCalStageName(calStage),
                 (long)calTargetSigned, (long)adcCountsToMv(calTargetSigned));
        }
    } else if (event.event == PSOC_EVT_CAL_SWEEP_MEAS32) {
        calSweepRaw = (calSweepRaw << 8) | event.value;
        calSweepRawByte++;
        if (calSweepRawByte >= 4) {
            int32_t sweepSigned;
            uint32_t absRaw;
            int32_t cmpRaw;
            int32_t errRaw;
            calSweepRawByte = 0;
            sweepSigned = (int32_t)calSweepRaw;
            calSweepRaw = 0;
            absRaw = absCounts32(sweepSigned);
            cmpRaw = psocCalCompareCounts(sweepSigned);
            errRaw = calTargetValid ? (calTargetSigned - cmpRaw) : 0;
            SLAVE_LOG_PRINTF("[CAL] sweep stage=%u/%s dac=%u raw=%ld raw_mV=%ld abs=%lu cmp=%ld cmp_mV=%ld target=%ld target_mV=%ld err=%ld err_mV=%ld\n",
                             calStage, psocCalStageName(calStage), calDac,
                             (long)sweepSigned, (long)adcCountsToMv(sweepSigned),
                             (unsigned long)absRaw,
                             (long)cmpRaw, (long)adcCountsToMv(cmpRaw),
                             calTargetValid ? (long)calTargetSigned : 0L,
                             calTargetValid ? (long)adcCountsToMv(calTargetSigned) : 0L,
                             (long)errRaw, (long)adcCountsToMv(errRaw));
            LOGM("CAL_SWEEP", "stage=%u,name=%s,dac=%u,measRaw=%ld,raw_mV=%ld,abs=%lu,cmp=%ld,cmp_mV=%ld,target=%ld,target_mV=%ld,err=%ld,err_mV=%ld",
                 calStage, psocCalStageName(calStage), calDac,
                 (long)sweepSigned, (long)adcCountsToMv(sweepSigned),
                 (unsigned long)absRaw, (long)cmpRaw, (long)adcCountsToMv(cmpRaw),
                 calTargetValid ? (long)calTargetSigned : 0L,
                 calTargetValid ? (long)adcCountsToMv(calTargetSigned) : 0L,
                 (long)errRaw, (long)adcCountsToMv(errRaw));
        }
    } else if (event.event == PSOC_EVT_ADC_RAW32) {
        adcSnapshotRaw = (adcSnapshotRaw << 8) | event.value;
        adcSnapshotRawByte++;
        if (adcSnapshotRawByte >= 4) {
            int32_t adcSigned;
            uint32_t absRaw;
            int32_t cmpRaw;
            int32_t errRaw;
            adcSnapshotRawByte = 0;
            adcSigned = (int32_t)adcSnapshotRaw;
            adcSnapshotRaw = 0;
            absRaw = absCounts32(adcSigned);
            cmpRaw = psocCalCompareCounts(adcSigned);
            errRaw = calTargetValid ? (calTargetSigned - cmpRaw) : 0;
            SLAVE_LOG_PRINTF("[ADC] snapshot stage=%u/%s dac=%u raw=%ld raw_mV=%ld abs=%lu cmp=%ld cmp_mV=%ld target=%ld target_mV=%ld err=%ld err_mV=%ld\n",
                             calStage, psocCalStageName(calStage), calDac,
                             (long)adcSigned, (long)adcCountsToMv(adcSigned),
                             (unsigned long)absRaw, (long)cmpRaw,
                             (long)adcCountsToMv(cmpRaw),
                             calTargetValid ? (long)calTargetSigned : 0L,
                             calTargetValid ? (long)adcCountsToMv(calTargetSigned) : 0L,
                             (long)errRaw, (long)adcCountsToMv(errRaw));
            LOGM("ADC_SNAPSHOT", "stage=%u,name=%s,dac=%u,raw=%ld,raw_mV=%ld,abs=%lu,cmp=%ld,cmp_mV=%ld,target=%ld,target_mV=%ld,err=%ld,err_mV=%ld",
                 calStage, psocCalStageName(calStage), calDac,
                 (long)adcSigned, (long)adcCountsToMv(adcSigned),
                 (unsigned long)absRaw, (long)cmpRaw,
                 (long)adcCountsToMv(cmpRaw),
                 calTargetValid ? (long)calTargetSigned : 0L,
                 calTargetValid ? (long)adcCountsToMv(calTargetSigned) : 0L,
                 (long)errRaw, (long)adcCountsToMv(errRaw));
        }
    } else if (event.event == PSOC_EVT_CAL_PI_GAIN32 ||
               event.event == PSOC_EVT_CAL_PI_ERROR32 ||
               event.event == PSOC_EVT_CAL_PI_BUCKET32) {
        if (calPiRawByte == 0 || calPiRawEvent != event.event) {
            calPiRaw = 0;
            calPiRawByte = 0;
            calPiRawEvent = event.event;
        }
        calPiRaw = (calPiRaw << 8) | event.value;
        calPiRawByte++;
        if (calPiRawByte >= 4) {
            int32_t piSigned = (int32_t)calPiRaw;
            const char *kind =
                (event.event == PSOC_EVT_CAL_PI_GAIN32) ? "gain_x1000" :
                (event.event == PSOC_EVT_CAL_PI_ERROR32) ? "error_dac" :
                                                           "bucket";
            calPiRaw = 0;
            calPiRawByte = 0;
            calPiRawEvent = 0;
            SLAVE_LOG_PRINTF("[CAL] pi stage=%u/%s %s=%ld\n",
                             calStage, psocCalStageName(calStage),
                             kind, (long)piSigned);
            LOGM("CAL_PI", "stage=%u,name=%s,%s=%ld",
                 calStage, psocCalStageName(calStage),
                 kind, (long)piSigned);
        }
    } else if (event.event == PSOC_EVT_CAL_PI_DEADBAND) {
        SLAVE_LOG_PRINTF("[CAL] pi stage=%u/%s deadband_dac=%u\n",
                         calStage, psocCalStageName(calStage), event.value);
        LOGM("CAL_PI", "stage=%u,name=%s,deadband_dac=%u",
             calStage, psocCalStageName(calStage), event.value);
    } else if (event.event == PSOC_EVT_CAL_PI_STABLE) {
        SLAVE_LOG_PRINTF("[CAL] pi stage=%u/%s stable=%u\n",
                         calStage, psocCalStageName(calStage), event.value);
        LOGM("CAL_PI", "stage=%u,name=%s,stable=%u",
             calStage, psocCalStageName(calStage), event.value);
    } else if (event.event == PSOC_EVT_CAL_STAGE_MEAS) {
        if (!calMeasHigh) {
            calMeas = (int16_t)((uint16_t)event.value << 8);
            calMeasHigh = true;
        } else {
            calMeas = (int16_t)((uint16_t)calMeas | event.value);
            calMeasHigh = false;
#if PSOC_CAL_LOG_CLAMPED_POINTS
            SLAVE_LOG_PRINTF("[CAL] point16 stage=%u/%s dac=%u meas=%d\n",
                             calStage, psocCalStageName(calStage),
                             calDac, (int)calMeas);
            LOGM("CAL_POINT16", "stage=%u,name=%s,dac=%u,meas=%d",
                 calStage, psocCalStageName(calStage), calDac, (int)calMeas);
#endif
        }
    } else if (event.event == PSOC_EVT_CAL_STAGE_MEAS32) {
        calMeasRaw = (calMeasRaw << 8) | event.value;
        calMeasRawByte++;
        if (calMeasRawByte >= 4) {
            uint32_t absRaw;
            int32_t cmpRaw;
            int32_t errRaw;
            calMeasRawByte = 0;
            calMeasRawSigned = (int32_t)calMeasRaw;
            calMeasRaw = 0;
            absRaw = absCounts32(calMeasRawSigned);
            cmpRaw = psocCalCompareCounts(calMeasRawSigned);
            errRaw = calTargetValid ? (calTargetSigned - cmpRaw) : 0;
#if PSOC_CAL_LOG_POINTS
            SLAVE_LOG_PRINTF("[CAL] point stage=%u/%s i=%u dac=%u raw=%ld raw_mV=%ld abs=%lu cmp=%ld cmp_mV=%ld target=%ld target_mV=%ld err=%ld err_mV=%ld\n",
                             calStage, psocCalStageName(calStage),
                             (unsigned)calPointIndex, calDac,
                             (long)calMeasRawSigned, (long)adcCountsToMv(calMeasRawSigned),
                             (unsigned long)absRaw,
                             (long)cmpRaw, (long)adcCountsToMv(cmpRaw),
                             calTargetValid ? (long)calTargetSigned : 0L,
                             calTargetValid ? (long)adcCountsToMv(calTargetSigned) : 0L,
                             (long)errRaw, (long)adcCountsToMv(errRaw));
            LOGM("CAL_POINT32", "stage=%u,name=%s,i=%u,dac=%u,measRaw=%ld,raw_mV=%ld,abs=%lu,cmp=%ld,cmp_mV=%ld,target=%ld,target_mV=%ld,err=%ld,err_mV=%ld",
                 calStage, psocCalStageName(calStage),
                 (unsigned)calPointIndex, calDac, (long)calMeasRawSigned,
                 (long)adcCountsToMv(calMeasRawSigned),
                 (unsigned long)absRaw, (long)cmpRaw, (long)adcCountsToMv(cmpRaw),
                 calTargetValid ? (long)calTargetSigned : 0L,
                 calTargetValid ? (long)adcCountsToMv(calTargetSigned) : 0L,
                 (long)errRaw, (long)adcCountsToMv(errRaw));
#endif
            calPointIndex++;
        }
    } else if (event.event == PSOC_EVT_CAL_REALCHECK_DAC) {
        calDac = event.value;
        calMeasRaw = 0;
        calMeasRawByte = 0;
    } else if (event.event == PSOC_EVT_CAL_REALCHECK_MEAS32) {
        calMeasRaw = (calMeasRaw << 8) | event.value;
        calMeasRawByte++;
        if (calMeasRawByte >= 4) {
            uint32_t absRaw;
            calMeasRawByte = 0;
            calMeasRawSigned = (int32_t)calMeasRaw;
            absRaw = absCounts32(calMeasRawSigned);
#if PSOC_CAL_LOG_POINTS
            SLAVE_LOG_PRINTF("[CAL] realcheck point stage=%u/%s i=%u dac=%u raw=%ld abs=%lu\n",
                             calStage, psocCalStageName(calStage),
                             (unsigned)calPointIndex, calDac,
                             (long)calMeasRawSigned, (unsigned long)absRaw);
            LOGM("CAL_REALCHECK_POINT32", "stage=%u,name=%s,i=%u,dac=%u,measRaw=%ld,abs=%lu",
                 calStage, psocCalStageName(calStage),
                 (unsigned)calPointIndex, calDac, (long)calMeasRawSigned,
                 (unsigned long)absRaw);
#endif
            calPointIndex++;
        }
    } else if (event.event == PSOC_EVT_CAL_STAGE_OK) {
        uint32_t absRaw = absCounts32(calMeasRawSigned);
        int32_t cmpRaw = psocCalCompareCounts(calMeasRawSigned);
        int32_t errRaw = calTargetValid ? (calTargetSigned - cmpRaw) : 0;
        if (calStage < CMD_CAL_VDAC_STAGE_COUNT) {
            sendCfgAck((uint8_t)(CMD_CAL_VDAC_STAGE_BASE + calStage), calDac);
            sendCfgAckS16(CMD_CAL_TARGET_MV_HI_BASE, CMD_CAL_TARGET_MV_LO_BASE,
                          calStage, calTargetValid ? adcCountsToMv(calTargetSigned) : 0);
            sendCfgAckS16(CMD_CAL_ERROR_MV_HI_BASE, CMD_CAL_ERROR_MV_LO_BASE,
                          calStage, adcCountsToMv(errRaw));
        }
        SLAVE_LOG_PRINTF("[CAL] result stage=%u/%s ok=%u dac=%u raw=%ld raw_mV=%ld abs=%lu cmp=%ld cmp_mV=%ld target=%ld target_mV=%ld err=%ld err_mV=%ld meas16=%d\n",
                         calStage, psocCalStageName(calStage), event.value,
                         calDac, (long)calMeasRawSigned,
                         (long)adcCountsToMv(calMeasRawSigned),
                         (unsigned long)absRaw, (long)cmpRaw,
                         (long)adcCountsToMv(cmpRaw),
                         calTargetValid ? (long)calTargetSigned : 0L,
                         calTargetValid ? (long)adcCountsToMv(calTargetSigned) : 0L,
                         (long)errRaw, (long)adcCountsToMv(errRaw), (int)calMeas);
        LOGM("CAL_STAGE", "stage=%u,name=%s,ok=%u,dac=%u,measRaw=%ld,raw_mV=%ld,abs=%lu,cmp=%ld,cmp_mV=%ld,target=%ld,target_mV=%ld,err=%ld,err_mV=%ld,meas16=%d",
             calStage, psocCalStageName(calStage), event.value,
             calDac, (long)calMeasRawSigned,
             (long)adcCountsToMv(calMeasRawSigned),
             (unsigned long)absRaw,
             (long)cmpRaw, (long)adcCountsToMv(cmpRaw),
             calTargetValid ? (long)calTargetSigned : 0L,
             calTargetValid ? (long)adcCountsToMv(calTargetSigned) : 0L,
             (long)errRaw, (long)adcCountsToMv(errRaw),
             (int)calMeas);
    } else if (event.event == PSOC_EVT_SERVO_STEP) {
        SLAVE_LOG_PRINTF("[CAL] servo step stage=%u/%s dac=%u\n",
                         calStage, psocCalStageName(calStage), event.value);
        LOGM("SERVO_STEP", "stage=%u,name=%s,dac=%u",
             calStage, psocCalStageName(calStage), event.value);
    } else if (event.event == PSOC_EVT_CAL_LOOP) {
        SLAVE_LOG_PRINTF("[CAL] loop stage=%u/%s dac=%u -> best candidate\n",
                         calStage, psocCalStageName(calStage), event.value);
        LOGM("CAL_LOOP", "stage=%u,name=%s,dac=%u",
             calStage, psocCalStageName(calStage), event.value);
    } else if (event.event == PSOC_EVT_CAL_STAGE_SAT) {
        if (event.value) {
            SLAVE_LOG_PRINTF("[CAL] saturation stage=%u/%s dac=%u\n",
                             calStage, psocCalStageName(calStage), calDac);
            LOGM("CAL_SAT", "stage=%u,name=%s,dac=%u",
                 calStage, psocCalStageName(calStage), calDac);
        }
    } else if (event.event == PSOC_EVT_CAL_STAGE_SAT_ALL) {
        SLAVE_LOG_PRINTF("[CAL] all candidates saturated stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_SAT_ALL", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_CAL_REALCHECK_NUDGE) {
        int8_t nudge = (int8_t)event.value;
        SLAVE_LOG_PRINTF("[CAL] realcheck nudge stage=%u/%s dac=%u step=%d\n",
                         calStage, psocCalStageName(calStage), calDac,
                         (int)nudge);
        LOGM("CAL_REALCHECK_NUDGE", "stage=%u,name=%s,dac=%u,step=%d",
             calStage, psocCalStageName(calStage), calDac, (int)nudge);
    } else if (event.event == PSOC_EVT_CAL_REALCHECK_OK) {
        uint32_t absRaw = absCounts32(calMeasRawSigned);
        SLAVE_LOG_PRINTF("[CAL] realcheck result stage=%u/%s ok=%u dac=%u raw=%ld abs=%lu\n",
                         calStage, psocCalStageName(calStage), event.value,
                         calDac, (long)calMeasRawSigned,
                         (unsigned long)absRaw);
        LOGM("CAL_REALCHECK", "stage=%u,name=%s,ok=%u,dac=%u,measRaw=%ld,abs=%lu",
             calStage, psocCalStageName(calStage), event.value,
             calDac, (long)calMeasRawSigned, (unsigned long)absRaw);
    } else if (event.event == PSOC_EVT_CAL_VERIFY_OK) {
        uint32_t absRaw = absCounts32(calMeasRawSigned);
        SLAVE_LOG_PRINTF("[CAL] verify stage=%u/%s ok=%u dac=%u raw=%ld abs=%lu meas16=%d\n",
                         calStage, psocCalStageName(calStage), event.value,
                         calDac, (long)calMeasRawSigned,
                         (unsigned long)absRaw, (int)calMeas);
        LOGM("CAL_VERIFY", "stage=%u,name=%s,ok=%u,dac=%u,measRaw=%ld,abs=%lu,meas16=%d",
             calStage, psocCalStageName(calStage), event.value,
             calDac, (long)calMeasRawSigned, (unsigned long)absRaw,
             (int)calMeas);
    } else if (event.event == PSOC_EVT_CAL_AMUX_IN) {
        SLAVE_LOG_PRINTF("[CAL] AMux signal channel=%u\n", event.value);
        LOGM("CAL_AMUX_IN", "channel=%u", event.value);
    } else if (event.event == PSOC_EVT_CAL_AMUX_CAP) {
        SLAVE_LOG_PRINTF("[CAL] AMux cap channel=%u\n", event.value);
        LOGM("CAL_AMUX_CAP", "channel=%u", event.value);
    } else if (event.event == PSOC_EVT_CAL_PROGRESS) {
        if (!(g_cfg_waiting && g_cfg_sub_cmd == PSOC_CMD_CALIBRATE)) {
            uint32_t now = millis();
            if ((uint32_t)(now - g_cal_progress_ack_ms) >=
                PSOC_CAL_PROGRESS_ACK_PERIOD_MS) {
                g_cal_progress_ack_ms = now;
                sendCfgAck(PSOC_CMD_CALIBRATE, 2);
            }
        }
#if PSOC_CAL_LOG_PROGRESS
        SLAVE_LOG_PRINTF("[CAL] progress stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_PROGRESS", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
#endif
        /* Para calibracion manual, servicePsocConfigAck() emite el heartbeat
         * mientras g_cfg_waiting este activo. Para boot-cal autonoma no hay
         * pending ACK, asi que este evento mantiene vivo el estado del maestro. */
    } else if (event.event == PSOC_EVT_CAL_WATCHDOG) {
        SLAVE_LOG_PRINTF("[CAL] WATCHDOG timeout stage=%u/%s -> aborted\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_WATCHDOG", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_CAL_LP_BAD) {
        SLAVE_LOG_PRINTF("[CAL] CRITICAL stage=%u/%s LP out of range\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_LP_BAD", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_BUTTON) {
        SLAVE_LOG_PRINTF("[BUTTON] pressed pstate=%u/%s\n",
                         event.value, psocStateName(event.value));
        LOGM("BUTTON", "pstate=%u,pstateName=%s",
             event.value, psocStateName(event.value));
    } else if (event.event == PSOC_EVT_BUTTON_IGNORED) {
        SLAVE_LOG_PRINTF("[BUTTON] ignored pstate=%u/%s\n",
                         event.value, psocStateName(event.value));
        LOGM("BUTTON_IGNORED", "pstate=%u,pstateName=%s",
             event.value, psocStateName(event.value));
    } else if (event.event == PSOC_EVT_CAPTURE_CLAMPED) {
        SLAVE_LOG_PRINTF("[CAPTURE] clamped requested_sat=%u max=%u\n",
                         event.value, PSOC_CAPTURE_MAX_BATCHES);
        LOGM("CAPTURE_CLAMPED", "requested_sat=%u,max=%u",
             event.value, PSOC_CAPTURE_MAX_BATCHES);
    }

#if PSOC_DIAG_VERBOSE
    const char *eventName = psocDiagName(event.event);
    const char *stateName = psocStateName(event.psoc_state);
    SLAVE_LOG_PRINTF("[SLAVE] PSOC_EVT %s event=0x%02X val=%u pstate=%u/%s estate=%d bytes=%lu bOK=%lu fill=%u/%u\n",
                     eventName, event.event, event.value,
                     event.psoc_state, stateName, (int)g_state,
                     (unsigned long)psoc.bytesRx(),
                     (unsigned long)psoc.batchesOK(),
                     (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
    LOGM("PSOC_EVT", "event=0x%02X,name=%s,val=%u,pstate=%u,pstateName=%s,estate=%d,bytes=%lu,bOK=%lu,fill=%u/%u",
         event.event, eventName, event.value,
         event.psoc_state, stateName, (int)g_state,
         (unsigned long)psoc.bytesRx(),
         (unsigned long)psoc.batchesOK(),
         (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
#endif
}

