simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
/* ── ISR GPIO hardware sync (IRAM para máxima velocidad) ────────────────── */
void IRAM_ATTR onSyncEdge()
{
    int level = digitalRead(SYNC_IN_PIN);
    if (level == HIGH && g_state == HOT_WAIT) {
        digitalWrite(SYNC_TO_PSOC_PIN, HIGH);
        uint32_t nowUs = (uint32_t)micros();
        g_t_start_us    = (uint64_t)nowUs;
        g_store_fill    = 0;
        g_debug_count   = 0;
        g_debug_last_us = nowUs;
        g_sync_edge_started = true; /* loop() completa el bookkeeping fuera del ISR */
        g_state = SAMPLING;
    } else if (level == LOW && g_state == SAMPLING) {
        digitalWrite(SYNC_TO_PSOC_PIN, LOW);
        g_state = STOPPED;
    } else if (g_state != SAMPLING) {
        digitalWrite(SYNC_TO_PSOC_PIN, LOW);
    }
}

/* ── Forward declarations ────────────────────────────────────────────────── */
static void allocStore(uint16_t n_batches);
static void handleReqBatch(const MsgReqBatch *msg);
static void sendHotWaitAck();

/* ── Callbacks ESP-NOW ───────────────────────────────────────────────────── */

static void sendCfgAck(uint8_t sub_cmd, uint8_t ok)
{
    MsgCfgAck ack = { CMD_CFG_ACK, NODE_ID, sub_cmd, ok };
    sendToMaster((const uint8_t *)&ack, sizeof(ack));
}

static void clearCompletionAckRetry()
{
    g_completion_ack_sub_cmd = 0;
    g_completion_ack_ok = 0;
    g_completion_ack_retries_left = 0;
    g_completion_ack_next_ms = 0;
}

static void sendCompletionAckWithRetry(uint8_t sub_cmd)
{
    sendCfgAck(sub_cmd, 2);
    g_completion_ack_sub_cmd = sub_cmd;
    g_completion_ack_ok = 2;
    g_completion_ack_retries_left = COMPLETION_ACK_RETRY_COUNT;
    g_completion_ack_next_ms = millis() + COMPLETION_ACK_RETRY_PERIOD_MS;
}

static void serviceCompletionAckRetry()
{
    if (g_completion_ack_sub_cmd == 0 || g_completion_ack_retries_left == 0) {
        return;
    }
    if ((int32_t)(millis() - g_completion_ack_next_ms) < 0) {
        return;
    }
    sendCfgAck(g_completion_ack_sub_cmd, g_completion_ack_ok);
    g_completion_ack_retries_left--;
    g_completion_ack_next_ms = millis() + COMPLETION_ACK_RETRY_PERIOD_MS;
}

static bool isGainCode(uint8_t code)
{
    return code <= 8u;
}

static bool isAdcConfigCode(uint8_t code)
{
    return code >= 1u && code <= 4u;
}

static bool isDecimationFactor(uint8_t factor)
{
    return factor >= 1u && factor <= 100u;
}

static void applyConfirmedConfig(uint8_t sub_cmd, uint8_t value)
{
    switch (sub_cmd) {
        case 0xA6:
            g_pga_code = value;
            break;
        case 0xA9:
            g_pgavdac = value;
            break;
        case 0xAA:
            g_vdac_byte = value;
            break;
        case PSOC_CMD_SD_CAPTURE:
            g_psoc_sd_capture_enabled = (value != 0u);
            break;
        default:
            break;
    }
}

static uint8_t expectedPsocAckValue(uint8_t sub_cmd, uint8_t param)
{
    /* SAVE_EEPROM se envia con parametro 0, pero el PSoC responde 1 si grabo bien. */
    return (sub_cmd == PSOC_CMD_SAVE_EEPROM) ? 1u : param;
}

static void waitForPsocConfigAck(uint8_t sub_cmd, uint8_t param)
{
    g_cfg_sub_cmd = sub_cmd;
    g_cfg_param = param;
    g_cfg_start_ms = millis();
    g_cfg_timeout_ms = (sub_cmd == PSOC_CMD_CALIBRATE)
                     ? PSOC_CAL_ACK_TIMEOUT_MS
                     : ((sub_cmd == PSOC_CMD_ADC_SNAPSHOT)
                        ? PSOC_ADC_SNAPSHOT_ACK_TIMEOUT_MS
                        : PSOC_CFG_ACK_TIMEOUT_MS);
    g_cfg_waiting = true;
    if (sub_cmd == PSOC_CMD_CALIBRATE) {
        /* Que el primer "calibrando..." salga ya en el proximo loop(),
         * sin esperar PSOC_CAL_PROGRESS_ACK_PERIOD_MS. */
        g_cal_progress_ack_ms = g_cfg_start_ms - PSOC_CAL_PROGRESS_ACK_PERIOD_MS;
    }
}

static bool ensurePsocReadyForConfig()
{
    psoc.poll();
    if (g_psocConnected && psoc.hasLastByte() &&
        psoc.lastByteAgeMs() <= PSOC_CFG_READY_STALE_MS) {
        return true;
    }

    const bool ready = psoc.probe(250);
    g_psocConnected = ready;
    if (!ready) {
        SLAVE_LOG_PRINTF("[SLAVE] PSoC cfg probe failed age=%lu bytes=%lu\n",
                         (unsigned long)psoc.lastByteAgeMs(),
                         (unsigned long)psoc.bytesRx());
        LOGM("CFG_PSOC_MISS", "age=%lu,bytes=%lu",
             (unsigned long)psoc.lastByteAgeMs(),
             (unsigned long)psoc.bytesRx());
    }
    return ready;
}

static void servicePsocConfigAck()
{
    if (g_state == SAMPLING) {
        return;   /* Nunca emitir ACK/timeout por radio durante la captura. */
    }

    uint8_t ackCmd = 0;
    uint8_t ackVal = 0;
    while (psoc.takeConfigAck(ackCmd, ackVal)) {
        g_psocConnected = true;
        if (ackCmd == PSOC_CMD_SD_READ_BATCH && g_psoc_sd_read_pending) {
            MsgCfgAck nack = { CMD_CFG_ACK, NODE_ID, CMD_REQ_BATCH, 0 };
            sendToMaster((const uint8_t *)&nack, sizeof(nack));
            g_psoc_sd_read_pending = false;
            SLAVE_LOG_PRINTF("[SLAVE] PSoC SD_READ NACK seq=%u val=%u\n",
                             (unsigned)g_psoc_sd_read_seq, (unsigned)ackVal);
            continue;
        }
        if (g_cfg_waiting && ackCmd == g_cfg_sub_cmd) {
            const uint8_t expected = expectedPsocAckValue(g_cfg_sub_cmd, g_cfg_param);
            const uint8_t ok = (ackVal == expected) ? 1u : 0u;
            if (ok) {
                applyConfirmedConfig(ackCmd, ackVal);
            }
            sendCfgAck(g_cfg_sub_cmd, ok);
            SLAVE_LOG_PRINTF("[SLAVE] PSoC cfg ack sub=0x%02X val=%u expected=%u ok=%u\n",
                             ackCmd, ackVal, expected, ok);
            LOGM("CFG_ACK", "sub=0x%02X,val=%u,expected=%u,ok=%u",
                 ackCmd, ackVal, expected, ok);
            g_cfg_waiting = false;
        } else {
            applyConfirmedConfig(ackCmd, ackVal);
            SLAVE_LOG_PRINTF("[SLAVE] PSoC cfg ack unsolicited sub=0x%02X val=%u\n",
                             ackCmd, ackVal);
            LOGM("CFG_ACK_UNSOL", "sub=0x%02X,val=%u", ackCmd, ackVal);
        }
    }

    if (g_cfg_waiting &&
        (uint32_t)(millis() - g_cfg_start_ms) >= g_cfg_timeout_ms) {
        const uint8_t expected = expectedPsocAckValue(g_cfg_sub_cmd, g_cfg_param);
        sendCfgAck(g_cfg_sub_cmd, 0);
        SLAVE_LOG_PRINTF("[SLAVE] PSoC cfg ack timeout sub=0x%02X expected=%u elapsed=%lu/%lu\n",
                         g_cfg_sub_cmd, expected,
                         (unsigned long)(millis() - g_cfg_start_ms),
                         (unsigned long)g_cfg_timeout_ms);
        LOGM("CFG_TIMEOUT", "sub=0x%02X,expected=%u,elapsed=%lu,timeout=%lu",
             g_cfg_sub_cmd, expected,
             (unsigned long)(millis() - g_cfg_start_ms),
             (unsigned long)g_cfg_timeout_ms);
        g_cfg_waiting = false;
    }

    /* "Calibrando..." (ok=2) hacia el maestro: por temporizador propio del
     * ESP, independiente de que el stream de diagnostico del PSoC llegue.
     * Mientras g_cfg_waiting este activo para CALIBRATE (hasta
     * PSOC_CAL_ACK_TIMEOUT_MS=450s o el ack final), repetir cada
     * PSOC_CAL_PROGRESS_ACK_PERIOD_MS para que el panel muestre el estado
     * "Calibrando..." de forma confiable. */
    if (g_cfg_waiting && g_cfg_sub_cmd == PSOC_CMD_CALIBRATE) {
        uint32_t now = millis();
        if ((uint32_t)(now - g_cal_progress_ack_ms) >= PSOC_CAL_PROGRESS_ACK_PERIOD_MS) {
            g_cal_progress_ack_ms = now;
            sendCfgAck(PSOC_CMD_CALIBRATE, 2);
        }
    }
}

static bool sendAndConfirmPsocSetN(uint16_t n_batches)
{
    const uint8_t expected = (n_batches > 255u) ? 255u : (uint8_t)n_batches;
    const uint32_t startMs = millis();
    const uint32_t startSeq = g_psoc_setn_seq;

    psoc.setN(n_batches);
    while ((uint32_t)(millis() - startMs) < PSOC_SETN_ACK_TIMEOUT_MS) {
        psoc.poll();
        servicePsocConfigAck();
        if (g_psoc_setn_seq != startSeq &&
            g_psoc_last_setn_value == expected &&
            (int32_t)(g_psoc_last_setn_ms - startMs) >= 0) {
            return true;
        }
        delay(1);
    }

    SLAVE_LOG_PRINTF("[SLAVE] PSoC SETN ack timeout n=%u expected=%u last=%u age=%lu\n",
                     (unsigned)n_batches, (unsigned)expected,
                     (unsigned)g_psoc_last_setn_value,
                     (unsigned long)(millis() - g_psoc_last_setn_ms));
    LOGM("SETN_TIMEOUT", "n=%u,expected=%u,last=%u,age=%lu",
         (unsigned)n_batches, (unsigned)expected,
         (unsigned)g_psoc_last_setn_value,
         (unsigned long)(millis() - g_psoc_last_setn_ms));
    return false;
}

