simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
static bool captureOrDumpBusy()
{
    return (g_state == SAMPLING || g_state == HOT_WAIT ||
            g_view_remaining != 0 ||
            (g_state == STOPPED && g_rec_n_batches > 0));
}

static bool requestPsocCalibration(const char *source)
{
    if (captureOrDumpBusy()) {
        SLAVE_LOG_PRINTF("[%s] cal ignored: capture/dump busy state=%d\n",
                         source, (int)g_state);
        LOGM("CAL_REQ", "source=%s,ok=0,reason=capture_busy,state=%d",
             source, (int)g_state);
        return false;
    }

    servicePsocConfigAck();
    if (g_cfg_waiting) {
        SLAVE_LOG_PRINTF("[%s] cal ignored: pending sub=0x%02X\n",
                         source, g_cfg_sub_cmd);
        LOGM("CAL_REQ", "source=%s,ok=0,reason=cfg_busy,pending=0x%02X",
             source, g_cfg_sub_cmd);
        return false;
    }

    if (!ensurePsocReadyForConfig()) {
        SLAVE_LOG_PRINTF("[%s] cal failed: PSoC not ready\n", source);
        LOGM("CAL_REQ", "source=%s,ok=0,reason=psoc_not_ready", source);
        return false;
    }

    psoc.calibrate();
    waitForPsocConfigAck(PSOC_CMD_CALIBRATE, 1);
    SLAVE_LOG_PRINTF("[%s] cal -> PSoC CMD 0x%02X\n", source, PSOC_CMD_CALIBRATE);
    LOGM("CAL_REQ", "source=%s,ok=1,sub=0x%02X", source, PSOC_CMD_CALIBRATE);
    return true;
}

static bool requestPsocAdcSnapshot(const char *source)
{
    if (captureOrDumpBusy()) {
        SLAVE_LOG_PRINTF("[%s] adc ignored: capture/dump busy state=%d\n",
                         source, (int)g_state);
        LOGM("ADC_REQ", "source=%s,ok=0,reason=capture_busy,state=%d",
             source, (int)g_state);
        return false;
    }

    servicePsocConfigAck();
    if (g_cfg_waiting) {
        SLAVE_LOG_PRINTF("[%s] adc ignored: pending sub=0x%02X\n",
                         source, g_cfg_sub_cmd);
        LOGM("ADC_REQ", "source=%s,ok=0,reason=cfg_busy,pending=0x%02X",
             source, g_cfg_sub_cmd);
        return false;
    }

    if (!ensurePsocReadyForConfig()) {
        SLAVE_LOG_PRINTF("[%s] adc failed: PSoC not ready\n", source);
        LOGM("ADC_REQ", "source=%s,ok=0,reason=psoc_not_ready", source);
        return false;
    }

    psoc.adcSnapshot();
    waitForPsocConfigAck(PSOC_CMD_ADC_SNAPSHOT, 1);
    SLAVE_LOG_PRINTF("[%s] adc -> PSoC CMD 0x%02X\n", source, PSOC_CMD_ADC_SNAPSHOT);
    LOGM("ADC_REQ", "source=%s,ok=1,sub=0x%02X", source, PSOC_CMD_ADC_SNAPSHOT);
    return true;
}

#if PSOC_AUTO_CAL_ON_READY
static void scheduleAutoCalibration(uint32_t delayMs)
{
    if (!g_auto_cal_requested) {
        g_auto_cal_due_ms = millis() + delayMs;
        SLAVE_LOG_PRINTF("[AUTO_CAL] scheduled in %lu ms (due=%lu)\n",
                         (unsigned long)delayMs, (unsigned long)g_auto_cal_due_ms);
        LOGM("AUTO_CAL", "ev=scheduled,delay_ms=%lu", (unsigned long)delayMs);
    }
}

static void serviceAutoCalibration()
{
    if (g_auto_cal_requested || g_auto_cal_due_ms == 0u) {
        return;
    }
    if ((int32_t)(millis() - g_auto_cal_due_ms) < 0) {
        return;
    }
    if (!g_psocConnected || captureOrDumpBusy() || g_cfg_waiting) {
        SLAVE_LOG_PRINTF("[AUTO_CAL] deferred (psocConnected=%d busy=%d cfg_waiting=%d) retry in %lu ms\n",
                         (int)g_psocConnected, (int)captureOrDumpBusy(), (int)g_cfg_waiting,
                         (unsigned long)PSOC_AUTO_CAL_RETRY_MS);
        LOGM("AUTO_CAL", "ev=deferred,psoc=%d,busy=%d,cfg_waiting=%d",
             (int)g_psocConnected, (int)captureOrDumpBusy(), (int)g_cfg_waiting);
        g_auto_cal_due_ms = millis() + PSOC_AUTO_CAL_RETRY_MS;
        return;
    }
    SLAVE_LOG_PRINTF("[AUTO_CAL] due -> requesting calibration\n");
    if (requestPsocCalibration("AUTO")) {
        g_auto_cal_requested = true;
        g_auto_cal_due_ms = 0u;
        LOGM("AUTO_CAL", "ev=requested,ok=1");
    } else {
        SLAVE_LOG_PRINTF("[AUTO_CAL] request failed, retry in %lu ms\n",
                         (unsigned long)PSOC_AUTO_CAL_RETRY_MS);
        LOGM("AUTO_CAL", "ev=requested,ok=0");
        g_auto_cal_due_ms = millis() + PSOC_AUTO_CAL_RETRY_MS;
    }
}
#else
static void scheduleAutoCalibration(uint32_t) {}
static void serviceAutoCalibration() {}
#endif

#if SLAVE_USB_CMD_ENABLE
static bool usbCommandEquals(const char *cmd, const char *word)
{
    while (*cmd != '\0' && *word != '\0') {
        char a = *cmd++;
        char b = *word++;
        if (a >= 'A' && a <= 'Z') { a = (char)(a - 'A' + 'a'); }
        if (b >= 'A' && b <= 'Z') { b = (char)(b - 'A' + 'a'); }
        if (a != b) { return false; }
    }
    return *cmd == '\0' && *word == '\0';
}

static bool usbCommandStartsWithWord(const char *cmd, const char *word)
{
    while (*cmd != '\0' && *word != '\0') {
        char a = *cmd++;
        char b = *word++;
        if (a >= 'A' && a <= 'Z') { a = (char)(a - 'A' + 'a'); }
        if (b >= 'A' && b <= 'Z') { b = (char)(b - 'A' + 'a'); }
        if (a != b) { return false; }
    }
    return *word == '\0' && (*cmd == ' ' || *cmd == '=' || *cmd == ':');
}

static bool usbParseGainParam(const char *cmd, const char *word, uint8_t &value)
{
    if (!usbCommandStartsWithWord(cmd, word)) {
        return false;
    }
    while (*cmd != '\0' && *cmd != ' ' && *cmd != '=' && *cmd != ':') {
        cmd++;
    }
    while (*cmd == ' ' || *cmd == '=' || *cmd == ':') {
        cmd++;
    }
    if (*cmd < '0' || *cmd > '8') {
        return false;
    }
    value = (uint8_t)(*cmd - '0');
    cmd++;
    while (*cmd == ' ') {
        cmd++;
    }
    return *cmd == '\0';
}

static bool usbParseU16Param(const char *cmd, const char *word, uint16_t &value)
{
    uint32_t acc = 0;
    if (!usbCommandStartsWithWord(cmd, word)) {
        return false;
    }
    while (*cmd != '\0' && *cmd != ' ' && *cmd != '=' && *cmd != ':') {
        cmd++;
    }
    while (*cmd == ' ' || *cmd == '=' || *cmd == ':') {
        cmd++;
    }
    if (*cmd < '0' || *cmd > '9') {
        return false;
    }
    while (*cmd >= '0' && *cmd <= '9') {
        acc = (acc * 10u) + (uint32_t)(*cmd - '0');
        if (acc > 65535u) {
            return false;
        }
        cmd++;
    }
    while (*cmd == ' ') {
        cmd++;
    }
    if (*cmd != '\0') {
        return false;
    }
    value = (uint16_t)acc;
    return true;
}

#if SLAVE_LAB_TOOLS_ENABLE
static void requestPrestartFromUsb(uint16_t n);
static void requestStartNowFromUsb(uint16_t n);
static void requestCaptureFromUsb(uint16_t n);

static bool usbParseTwoU16Params(const char *cmd, const char *word,
                                 uint16_t &first, uint16_t &second)
{
    uint32_t values[2] = {0u, 0u};
    uint8_t index = 0u;

