simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
static void servicePsocSdReadTimeout()
{
    if (!g_psoc_sd_read_pending ||
        (uint32_t)(millis() - g_psoc_sd_read_started_ms) < PSOC_SD_READ_TIMEOUT_MS) {
        return;
    }
    MsgCfgAck nack = { CMD_CFG_ACK, NODE_ID, CMD_REQ_BATCH, 0 };
    sendToMaster((const uint8_t *)&nack, sizeof(nack));
    SLAVE_LOG_PRINTF("[SLAVE] PSoC SD_READ timeout seq=%u\n",
                     (unsigned)g_psoc_sd_read_seq);
    g_psoc_sd_read_pending = false;
}

/* ── Callback PSoC — batch recibido ─────────────────────────────────────── */

static void psocBatchToStored(const PsocBatch &batch, SampleBytes *dst)
{
    for (int i = 0; i < SPI_BATCH_SAMPLES; i++) {
        const PsocSample &s = batch.samples[i];
        dst[i].raw_lo = (uint8_t)(s.raw_input & 0xFF);
        dst[i].raw_hi = (uint8_t)((s.raw_input >> 8) & 0xFF);
        dst[i].alog0 = (uint8_t)(s.post_analog & 0xFF);
        dst[i].alog1 = (uint8_t)((s.post_analog >> 8) & 0xFF);
        dst[i].alog2 = (uint8_t)((s.post_analog >> 16) & 0xFF);
        dst[i].digi0 = (uint8_t)(s.post_digital & 0xFF);
        dst[i].digi1 = (uint8_t)((s.post_digital >> 8) & 0xFF);
        dst[i].digi2 = (uint8_t)((s.post_digital >> 16) & 0xFF);
        dst[i].gain = s.gain_byte;
        dst[i].flags = s.sample_flags;
    }
}

static void onBatch(const PsocBatch &batch)
{
    g_psocConnected = true;

    if (g_psoc_sd_read_pending) {
        if (batch.seq != g_psoc_sd_read_seq) {
            SLAVE_LOG_PRINTF("[SLAVE] SD batch seq=%u, esperado=%u: ignorado\n",
                             (unsigned)batch.seq, (unsigned)g_psoc_sd_read_seq);
            return;
        }
        SampleBytes stored[SPI_BATCH_SAMPLES];
        const uint16_t seq = g_psoc_sd_read_seq;
        uint32_t fs = effectivePsocSampleRateHz();
        if (fs == 0u) fs = PSOC_NATIVE_SAMPLE_RATE_HZ;
        psocBatchToStored(batch, stored);
        g_psoc_sd_read_pending = false;
        const uint64_t ts = g_t_start_us +
            ((uint64_t)seq * SPI_BATCH_SAMPLES * 1000000ULL) / fs;
        transport.sendStoredBatch(stored, seq, ts, NODE_ID);
        return;
    }

    if (g_state != SAMPLING || g_psoc_sd_store_active) return;

    if (g_view_remaining > 0) {
        g_view_remaining = 0;   /* fail-safe: VIEW live no debe transmitir mientras muestrea */
    }

    /* Store-and-forward RAM: el camino SD no llega aquí; se lee por 0xBF. */
    if (storeRamReady() && g_store_fill < g_rec_n_batches) {
        SampleBytes *dst = storeBatchPtr(g_store_fill);
        if (!dst) {
            return;
        }
        psocBatchToStored(batch, dst);
        uint32_t tsRel = (uint32_t)batch.timestamp_us;
        g_store_ts_us[g_store_fill] = tsRel;
        g_store_fill++;
        if (g_store_fill >= g_rec_n_batches) {
            g_state = STOPPED;
            digitalWrite(SYNC_TO_PSOC_PIN, LOW);
            SLAVE_LOG_PRINTF("[SLAVE] FULL -> STOPPED (%u batches)\n", g_store_fill);
            if (g_view_store_active) {
                g_view_store_active = false;
                g_start_store_active = false;
                sendCompletionAckWithRetry(CMD_VIEW);   /* VIEW_DONE: ahora sí puede empezar el dump */
                SLAVE_LOG_PRINTF("[SLAVE] VIEW capture done -> ACK\n");
                LOGM("VIEWDONE", "store=1,n=%u", g_store_fill);
            } else if (g_start_store_active) {
                g_start_store_active = false;
                sendCompletionAckWithRetry(CMD_START);  /* START_DONE: master puede dumpear */
                SLAVE_LOG_PRINTF("[SLAVE] START capture done -> ACK\n");
                LOGM("STARTDONE", "store=1,n=%u", g_store_fill);
            }
        }
    } else if (g_debug_mode) {
        /* Test: transmitir en vivo la rampa (no es señal ADC real, RF no afecta). */
        SampleBytes sb[SPI_BATCH_SAMPLES];
        for (int i = 0; i < SPI_BATCH_SAMPLES; i++) {
            const PsocSample &ps = batch.samples[i];
            sb[i].raw_lo = (uint8_t)( ps.raw_input          & 0xFF);
            sb[i].raw_hi = (uint8_t)((ps.raw_input   >>  8) & 0xFF);
            sb[i].alog0  = (uint8_t)( ps.post_analog         & 0xFF);
            sb[i].alog1  = (uint8_t)((ps.post_analog  >>  8) & 0xFF);
            sb[i].alog2  = (uint8_t)((ps.post_analog  >> 16) & 0xFF);
            sb[i].digi0  = (uint8_t)( ps.post_digital         & 0xFF);
            sb[i].digi1  = (uint8_t)((ps.post_digital >>  8) & 0xFF);
            sb[i].digi2  = (uint8_t)((ps.post_digital >> 16) & 0xFF);
            sb[i].gain   = ps.gain_byte;
            sb[i].flags  = ps.sample_flags;
        }
        uint64_t ts = g_t_start_us + (uint64_t)batch.timestamp_us;
        transport.sendStoredBatch(sb, g_store_fill, ts, NODE_ID);
        g_store_fill++;
    }
}

/* ── Setup ───────────────────────────────────────────────────────────────── */

void setup()
{
    dbgLogBegin(DBG_LOG_BAUD);   /* Serial USB del esclavo = canal de log */
    SLAVE_LOG_PRINTF("[SLAVE %d] boot\n", NODE_ID);
    /* SD-en-ESP32 purgada (2026-07-11): la SD vive en el PSoC. sd_storage.*
     * queda como stub sin inicializar; sd_present sale de PSOC_EVT_SD_STATUS. */
    /* Heap: el store usa paginas de STORE_PAGE_BATCHES lotes, asi el limite
     * RAM-only lo da la suma de heap util y el buffer PSoC, no un bloque gigante. */
    SLAVE_LOG_PRINTF("[SLAVE %d] heap free=%u maxAlloc=%u (~%u lotes contiguos antiguos)\n",
                     NODE_ID, (unsigned)ESP.getFreeHeap(),
                     (unsigned)ESP.getMaxAllocHeap(),
                     (unsigned)(ESP.getMaxAllocHeap() / 304u));
    samplePulseBegin();
    debugEspHardwareBegin();
    SLAVE_LOG_PRINTF("[SCOPE] sample pulse pin=%d idle=%d us=%d\n",
                     SAMPLE_PULSE_PIN, SAMPLE_PULSE_IDLE, SAMPLE_PULSE_US);
    SLAVE_LOG_PRINTF("[SCOPE] debugHardware=%d start pin=%d idle=%d us=%d\n",
                     DEBUG_HARDWARE, DEBUG_HW_START_PIN,
                     DEBUG_HW_START_IDLE, DEBUG_HW_START_US);

#if defined(ESP8266)
    /* Modo AP oculto en canal 1: evita el background scanning que hace el
     * ESP8266 en modo STA desconectado (recorre ch1-13 buscando APs y pierde
     * paquetes ESP-NOW del canal 1 a distancia real). */
    WiFi.mode(WIFI_AP);
    WiFi.setSleepMode(WIFI_NONE_SLEEP);
    WiFi.setOutputPower(20.5f);
    WiFi.softAP("GeoSlave", "", 1, 1);   /* ssid, pass vacío, canal 1, oculto */
    delay(100);
    SLAVE_LOG_PRINTF("[SLAVE] MAC: %s  ch=%d (AP-fixed)\n",
                     WiFi.macAddress().c_str(), wifi_get_channel());
#else
    WiFi.mode(WIFI_STA);
    WiFi.setSleep(false);
    esp_wifi_set_ps(WIFI_PS_NONE);
    esp_wifi_set_max_tx_power(WIFI_TX_POWER_QDBM);
    WiFi.disconnect();
    delay(100);
    /* Fijar canal 1 explícitamente para coincidir con el AP del maestro.
     * Sin esto, STA desconectado puede quedar en canal 0 (indefinido) y los
     * paquetes ESP-NOW se pierden porque maestro y esclavo están en canales distintos. */
    esp_wifi_set_channel(1, WIFI_SECOND_CHAN_NONE);
    SLAVE_LOG_PRINTF("[SLAVE] MAC: %s  ch=%d\n",
                     WiFi.macAddress().c_str(), WiFi.channel());
    SLAVE_LOG_PRINTF("[SLAVE] WiFi ps=off tx=%d qdBm\n", WIFI_TX_POWER_QDBM);
#endif

    /* ESP-NOW */
    if (!transport.begin(g_masterTxMac)) {
        SLAVE_LOG_PRINTLN("[SLAVE] ESP-NOW FAIL - halt");
        while (true) { delay(1000); }
    }
    esp_now_register_recv_cb(onDataRecv);

    /* (El LED de identificación es el del PSoC; el ESP ya no maneja ningún LED.) */

