simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
    /* GPIO hardware sync — pull-down para evitar ISR espurias cuando no hay cable */
    pinMode(SYNC_IN_PIN,      INPUT_PULLDOWN);
    pinMode(SYNC_TO_PSOC_PIN, OUTPUT);
    digitalWrite(SYNC_TO_PSOC_PIN, LOW);
    attachInterrupt(digitalPinToInterrupt(SYNC_IN_PIN), onSyncEdge, CHANGE);

    /* UART → PSoC */
    psoc.begin(onBatch);
    psoc.onDiag(onPsocDiag);
    g_psoc_rx_last_level = (uint8_t)digitalRead(PSOC_UART_RX);
    attachInterrupt(digitalPinToInterrupt(PSOC_UART_RX), onPsocRxEdge, CHANGE);
#if PSOC_RX_SCAN_ENABLE
    beginPsocRxScan();
#endif

    /* Intentar detectar el PSoC una vez. Si no responde, se reintenta cada 2 s
     * en loop() para no bloquear ESP-NOW ni la generación de batches debug. */
    SLAVE_LOG_PRINTF("[SLAVE %d] Buscando PSoC...\n", NODE_ID);
    g_psocConnected = psoc.probe(300);
    if (g_psocConnected) {
        SLAVE_LOG_PRINTF("[SLAVE %d] PSoC: DETECTADO\n", NODE_ID);
        LOGM("PSOC", "detected=1");
        scheduleAutoCalibration(PSOC_AUTO_CAL_DELAY_MS);
    } else {
        SLAVE_LOG_PRINTF("[SLAVE %d] PSoC sin respuesta — reintentando en loop\n", NODE_ID);
        LOGM("PSOC", "detected=0,retry=loop");
    }

    SLAVE_LOG_PRINTF("[SLAVE %d] listo, esperando ARM\n", NODE_ID);
    LOGM("BOOT", "node=%d,psoc=%d", NODE_ID, (int)g_psocConnected);
}

/* ── Loop ────────────────────────────────────────────────────────────────── */

void loop()
{
    if (g_state != SAMPLING) {
        debugEspHardwareService();
    }

    /* Drenar siempre la UART del PSoC (onBatch ignora si no está SAMPLING). */
    if (g_state == SAMPLING && g_debug_mode) {
        /* Debug ESP: un lote falso cada 30/2604 s. La expresión redondeada
         * mantiene esta ruta de laboratorio ligada a la Fs nativa canónica. */
        static const uint32_t DEBUG_BATCH_PERIOD_US =
            (SPI_BATCH_SAMPLES * 1000000UL + PSOC_NATIVE_SAMPLE_RATE_HZ / 2UL) /
            PSOC_NATIVE_SAMPLE_RATE_HZ;
        uint32_t nowUs = (uint32_t)micros();
        if ((uint32_t)(nowUs - g_debug_last_us) >= DEBUG_BATCH_PERIOD_US) {
            g_debug_last_us += DEBUG_BATCH_PERIOD_US;
            PsocBatch fake = {};
            fake.seq         = (uint16_t)(g_debug_count / SPI_BATCH_SAMPLES);
            fake.n_samples   = SPI_BATCH_SAMPLES;
            fake.timestamp_us= (uint64_t)micros() - g_t_start_us;
            for (int i = 0; i < SPI_BATCH_SAMPLES; i++) {
                fake.samples[i].post_digital = (int32_t)(g_debug_count & 0xFFFFFF);
                fake.samples[i].gain_byte = g_pga_code;
                fake.samples[i].sample_flags = 0;
                g_debug_count++;
            }
            onBatch(fake);
        }
    } else {
        psoc.poll();
    }
    servicePsocConfigAck();
    servicePsocSdReadTimeout();
    serviceUsbCommands();
    serviceAutoCalibration();
    serviceCompletionAckRetry();
    serviceHotWaitWatchdog();

    /* Arranque por flanco GPIO (onSyncEdge): completar fuera del ISR el mismo
     * bookkeeping que hace el handler de CMD_START, para que la captura por
     * sync de hardware también emita el ACK de completado y el fallback. */
    if (g_sync_edge_started) {
        g_sync_edge_started = false;
        g_sampling_start_ms = millis();
        g_sampling_start_psoc_bytes = psoc.bytesRx();
        g_sampling_start_batches_ok = psoc.batchesOK();
        g_start_fallback_sent = false;
        if (!g_view_store_active) {
            g_start_store_active = (g_rec_n_batches > 0 && storeAllocated());
        }
    }

    /* (El parpadeo de identificación lo hace ahora el PSoC con su Timer; el ESP
     * solo reenvía CMD_BLINK_LED por UART en onDataRecv.) */

    /* Mientras se llena el store (Ver/Test con n_batches>0), imprimir UART cada 1 s.
     * Esto separa cable/pin (uartBytes=0) de protocolo/baud (bytes sin frames)
     * de "onBatch no incrementa fill" (psoc.poll() no entrega PsocBatch). */
#if SLAVE_LOG_VIEW_UART
    static uint32_t lastViewDiagMs = 0;
    if (g_state == SAMPLING && g_rec_n_batches > 0 &&
        (millis() - lastViewDiagMs) >= 1000) {
        lastViewDiagMs = millis();
        logPsocUartDiag("VIEW_UART");
    }
#endif

    bool storeCaptureActive = g_view_store_active || g_start_store_active;
    if (g_state == SAMPLING && storeCaptureActive && g_rec_n_batches > 0 &&
        g_store_fill == 0 && !g_start_fallback_sent) {
        uint32_t elapsedMs = millis() - g_sampling_start_ms;
        uint32_t fallbackMs = expectedCaptureMs(g_rec_n_batches);
        uint32_t bytesNow = psoc.bytesRx();
        uint32_t batchesNow = psoc.batchesOK();
        if (elapsedMs >= fallbackMs && batchesNow == g_sampling_start_batches_ok) {
            const char *mode = g_view_store_active ? "VIEW" : "START";
            g_start_fallback_sent = true;
            SLAVE_LOG_PRINTF("[SLAVE] %s_SYNC_STALL elapsed=%lu/%lu sync=%d bytes=%lu->%lu bOK=%lu->%lu fill=%u/%u -> START_NOW UART\n",
                             mode,
                             (unsigned long)elapsedMs, (unsigned long)fallbackMs,
                             digitalRead(SYNC_TO_PSOC_PIN),
                             (unsigned long)g_sampling_start_psoc_bytes,
                             (unsigned long)bytesNow,
                             (unsigned long)g_sampling_start_batches_ok,
                              (unsigned long)batchesNow,
                              (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
            LOGM("CAPTURE_SYNC_STALL", "mode=%s,ms=%lu/%lu,sync=%d,bytes=%lu->%lu,bOK=%lu->%lu,fill=%u/%u",
                 mode,
                 (unsigned long)elapsedMs, (unsigned long)fallbackMs,
                 digitalRead(SYNC_TO_PSOC_PIN),
                 (unsigned long)g_sampling_start_psoc_bytes,
                 (unsigned long)bytesNow,
                 (unsigned long)g_sampling_start_batches_ok,
                 (unsigned long)batchesNow,
                 (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
            psoc.startNow();
        }
    }

